In [1]:
import pandas as pd
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [2]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [3]:
target = df.Survived
inputs = df.drop('Survived',axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [4]:
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [6]:
dumies = pd.get_dummies(inputs.Sex)
dumies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [7]:
inputs = pd.concat([inputs,dumies],axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [8]:
inputs = inputs.drop('Sex',axis='columns')
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [10]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [12]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [13]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(10)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1
6       1  54.000000  51.8625       0     1
7       3   2.000000  21.0750       0     1
8       3  27.000000  11.1333       1     0
9       2  14.000000  30.0708       1     0

In [14]:
from sklearn.model_selection import train_test_split

In [62]:
x_train,x_test,y_train,y_test = train_test_split(inputs,target,test_size=0.2)

In [63]:
len(x_train)

712

In [64]:
len(x_test)

179

In [65]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB() #we use GaussianNB WHEN the distribution of data is normal (bell shaped curve)

In [66]:
model.fit(x_train,y_train)

GaussianNB()

In [67]:
model.score(x_test,y_test)

0.8379888268156425

In [68]:
x_test[:10]

     Pclass        Age     Fare  female  male
873       3  47.000000   9.0000       0     1
654       3  18.000000   6.7500       1     0
209       1  40.000000  31.0000       0     1
368       3  29.699118   7.7500       1     0
91        3  20.000000   7.8542       0     1
791       2  16.000000  26.0000       0     1
555       1  62.000000  26.5500       0     1
125       3  12.000000  11.2417       0     1
317       2  54.000000  14.0000       0     1
789       1  46.000000  79.2000       0     1

In [69]:
y_test[:10]

873    0
654    0
209    1
368    1
91     0
791    0
555    0
125    1
317    0
789    0
Name: Survived, dtype: int64

In [70]:
model.predict(x_test[:10])

array([0, 1, 0, 1, 0, 0, 0, 0, 0, 0], dtype=int64)

In [71]:
model.predict_proba(x_test[:10])

array([[0.98902259, 0.01097741],
       [0.10109649, 0.89890351],
       [0.88532999, 0.11467001],
       [0.12636928, 0.87363072],
       [0.98737618, 0.01262382],
       [0.96522521, 0.03477479],
       [0.8275684 , 0.1724316 ],
       [0.98365012, 0.01634988],
       [0.97014293, 0.02985707],
       [0.6060672 , 0.3939328 ]])